In [ ]:
import pandas as pd

# First DataFrame
df1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['Alice', 'Bob', 'Charlie']
})

# Second DataFrame
df2 = pd.DataFrame({
    'id': [1, 2, 4],
    'score': [90, 85, 95]
})

# Merge like SQL JOIN on 'id'
# merged = pd.merge(df1, df2, on='id', how='inner')  # You can also try 'left', 'right', 'outer'
# print(merged)

pd.concat([df1, df2])               # Stack rows/columns

   id     name  score
0   1    Alice    NaN
1   2      Bob    NaN
2   3  Charlie    NaN
0   1      NaN   90.0
1   2      NaN   85.0
2   4      NaN   95.0